{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-claim_id",
    "2": "I-claim_id",
    "3": "B-policy_number",
    "4": "I-policy_number",
    "5": "B-policyholder_name",
    "6": "I-policyholder_name",
    "7": "B-date_of_loss",
    "8": "I-date_of_loss",
    "9": "B-loss_type",
    "10": "I-loss_type",
    "11": "B-location",
    "12": "I-location",
    "13": "B-estimated_damage",
    "14": "I-estimated_damage",
    "15": "B-deductible",
    "16": "I-deductible",
    "17": "B-reserve_set",
    "18": "I-reserve_set",
    "19": "B-adjuster_assigned",
    "20": "I-adjuster_assigned",
    "21": "B-claimant",
    "22": "I-claimant",
    "23": "B-effective_date",
    "24": "I-effective_date",
    "25": "B-state",
    "26": "I-state",
    "27": "B-coverage_type",
    "28": "I-coverage_type"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-adjuster_assigned": 19,
    "B-claim_id": 1,
    "B-claimant": 21,
    "B-coverage_type": 27,
    "B-date_of_loss": 7,
    "B-deductible": 15,
    "B-effective_date": 23,
    "B-estimated_damage": 13,
    "B-location": 11,
    "B-loss_type": 9,
    "B-policy_number": 3,
    "B-policyholder_name": 5,
    "B-reserve_set": 17,
    "B-state": 25,
    "I-adjuster_assigned": 20,
    "I-claim_id": 2,
    "I-claimant": 22,
    "I-coverage_type": 28,
    "I-date_of_loss": 8,
    "I-deductible": 16,
    "I-effective_date": 24,
    "I-estimated_damage": 14,
    "I-location": 12,
    "I-loss_type": 10,
    "I-policy_number": 4,
    "I-policyholder_name": 6,
    "I-reserve_set": 18,
    "I-state": 26,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.13.0",
  "use_cache": false,
  "vocab_size": 30522
}
