{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "application_commercial",
    "1": "application_personal",
    "2": "certificate_evidence",
    "3": "loss_notice",
    "4": "claims_correspondence",
    "5": "policy_change_endorsement",
    "6": "repair_estimate",
    "7": "supporting_evidence"
  },
  "initializer_range": 0.02,
  "label2id": {
    "application_commercial": 0,
    "application_personal": 1,
    "certificate_evidence": 2,
    "claims_correspondence": 4,
    "loss_notice": 3,
    "policy_change_endorsement": 5,
    "repair_estimate": 6,
    "supporting_evidence": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.13.0",
  "use_cache": false,
  "vocab_size": 30522
}
